kea/brain-dumper/sdkconfig.defaults
# ---------------------------------------------------------------------------
# Brain Dumper - ESP32-S3-PICO-1-N8R8 on Waveshare ESP32-S3-ePaper-1.54 V2
# ---------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# --- Flash: N8 = 8 MB, QIO ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: R8 = 8 MB octal ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- CPU ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# --- Console on native USB Serial/JTAG (no external UART needed) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- FATFS: long file names on heap, UTF-8 ---
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_CODEPAGE_850=y

# --- LVGL v9: monochrome 1bpp (I1) rendering, no RGB565 framebuffer ---
CONFIG_LV_COLOR_DEPTH_1=y
CONFIG_LV_DRAW_SW_SUPPORT_I1=y
CONFIG_LV_DRAW_SW_SUPPORT_RGB565=n
CONFIG_LV_DRAW_SW_SUPPORT_RGB888=n
CONFIG_LV_DRAW_SW_SUPPORT_XRGB8888=n
CONFIG_LV_DRAW_SW_SUPPORT_ARGB8888=n
CONFIG_LV_DRAW_SW_SUPPORT_L8=n
CONFIG_LV_DRAW_SW_SUPPORT_AL88=n
CONFIG_LV_DRAW_SW_SUPPORT_A8=n
# 200x200 on 1.54" is ~183 DPI, and I1 has no antialiasing to lean on:
# anything under 14 px loses its thin strokes when the renderer thresholds.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_16=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_CANVAS=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_IMGFONT=n
CONFIG_LV_USE_SNAPSHOT=n

# --- Networking ---
CONFIG_LWIP_LOCAL_HOSTNAME="braindumper"
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=24
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=24
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- HTTP client needs a big header budget for multipart uploads ---
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# --- TinyUSB (MSC transfer mode) ---
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_MSC_BUFSIZE=4096

# --- Deep sleep / RTC ---
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y

# Keep ESP_LOGD compiled in so the button tag can be turned up at runtime.
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---- Brain Dumper: rete e servizio di trascrizione --------------------------
# Sono solo i default con cui il dispositivo genera /sdcard/config.ini quando
# manca; il file sulla card vince sempre su questi.
CONFIG_BD_WIFI_SSID=""
CONFIG_BD_WIFI_PASSWORD=""
CONFIG_BD_STT_URL="http://192.168.1.10:8000/v1/audio/transcriptions"
CONFIG_BD_STT_MODEL="Systran/faster-whisper-medium"

# Lingua dell'interfaccia: en, fr, de, es, it. Indipendente da CONFIG_BD_STT_LANGUAGE,
# che dice al server di trascrizione in che lingua e' l'audio.
CONFIG_BD_UI_LANGUAGE="it"
